baloo/stm32f4xx-hal/src/serial.rs
                fn is_idle(& self) -> bool {
                    unsafe { (*$USARTX::ptr()).sr.read().idle().bit_is_set() }
                }

                fn is_txe(& self) -> bool {
                    unsafe { (*$USARTX::ptr()).sr.read().txe().bit_is_set() }
                }

                fn is_rxne(& self) -> bool {
                    unsafe { (*$USARTX::ptr()).sr.read().rxne().bit_is_set() }
                }
            }

            impl<PINS> serial::Read<u8> for Serial<$USARTX, PINS> {
                type Error = Error;

                fn read(&mut self) -> Poll<Result<u8, Error>> {
                    let mut rx: Rx<$USARTX> = Rx {
                        _usart: PhantomData,
                    };
                    rx.read()
                }
            }

            impl serial::Read<u8> for Rx<$USARTX> {
                type Error = Error;

                fn read(&mut self) -> Poll<Result<u8, Error>> {
                    // NOTE(unsafe) atomic read with no side effects
                    let sr = unsafe { (*$USARTX::ptr()).sr.read() };

                    // Any error requires the dr to be read to clear
                    if sr.pe().bit_is_set()
                        || sr.fe().bit_is_set()
                        || sr.nf().bit_is_set()
                        || sr.ore().bit_is_set()
                    {
                        unsafe { (*$USARTX::ptr()).dr.read() };
                    }

                    if sr.pe().bit_is_set() {
                        Ready(Err(Error::Parity))
                    } else if sr.fe().bit_is_set() {
                        Ready(Err(Error::Framing))
                    } else if sr.nf().bit_is_set() {
                        Ready(Err(Error::Noise))
                    } else if sr.ore().bit_is_set() {
                        Ready(Err(Error::Overrun))
                    } else if sr.rxne().bit_is_set() {
                        // NOTE(read_volatile) see `write_volatile` below
                        Ready(Ok(unsafe { ptr::read_volatile(&(*$USARTX::ptr()).dr as *const _ as *const _) }))
                    } else {
                        Pending
                    }
                }
            }

            impl IntrStream for Rx<$USARTX> {
                fn listen(&mut self, waker: Waker) {
                    free(|c| {
                        unsafe { (*$USARTX::ptr())
                            .cr1.modify(|_, w| w.rxneie().set_bit()) };
                        let mut context = $ctxX.borrow(c).borrow_mut();
                        let context = context.get_or_insert_with(|| Context::default());
                        context.rx_waker = Some(waker);
                    })
                }

                fn unlisten(&mut self) {
                    free(|c| {
                        let mut context = $ctxX.borrow(c).borrow_mut();
                        let context = context.as_mut();
                        self.unlisten_ctx(context);
                    })
                }
            }

            impl IntrStreamCtx for Rx<$USARTX> {
                fn unlisten_ctx(&mut self, ctx: Option<&mut Context>) {
                    if let Some(ctx) = ctx {
                        ctx.rx_waker = None;
                    }
                    unsafe { (*$USARTX::ptr())
                        .cr1.modify(|_, w| w.rxneie().clear_bit())}
                }
            }

            impl<PINS> serial::Write<u8> for Serial<$USARTX, PINS> {
                type Error = Error;

                fn flush(&mut self) -> Poll<Result<(), Self::Error>> {
                    let mut tx: Tx<$USARTX> = Tx {
                        _usart: PhantomData,
                    };
                    tx.flush()
                }

                fn write(&mut self, byte: u8) -> Poll<Result<(), Self::Error>> {
                    let mut tx: Tx<$USARTX> = Tx {
                        _usart: PhantomData,
                    };
                    tx.write(byte)
                }
            }

            impl serial::Write<u8> for Tx<$USARTX> {
                type Error = Error;

                fn flush(&mut self) -> Poll<Result<(), Self::Error>> {
                    // NOTE(unsafe) atomic read with no side effects
                    let sr = unsafe { (*$USARTX::ptr()).sr.read() };

                    if sr.tc().bit_is_set() {
                        Ready(Ok(()))
                    } else {
                        Pending
                    }
                }

                fn write(&mut self, byte: u8) -> Poll<Result<(), Self::Error>> {
                    // NOTE(unsafe) atomic read with no side effects
                    let sr = unsafe { (*$USARTX::ptr()).sr.read() };

                    if sr.txe().bit_is_set() {
                        // NOTE(unsafe) atomic write to stateless register
                        // NOTE(write_volatile) 8-bit write that's not possible through the svd2rust API
                        unsafe { ptr::write_volatile(&(*$USARTX::ptr()).dr as *const _ as *mut _, byte) }
                        Ready(Ok(()))
                    } else {
                        Pending
                    }
                }
            }

            impl IntrStream for Tx<$USARTX> {
                fn listen(&mut self, waker: Waker) {
                    free(|c| {
                        let mut context = $ctxX.borrow(c).borrow_mut();
                        let context = context.get_or_insert_with(|| Context::default());
                        context.tx_waker = Some(waker);
                        unsafe { (*$USARTX::ptr())
                            .cr1.modify(|_, w| w.txeie().set_bit().tcie().set_bit()) };
                    })
                }

                fn unlisten(&mut self) {
                    free(|c| {
                        let mut context = $ctxX.borrow(c).borrow_mut();
                        let context = context.as_mut();
                        self.unlisten_ctx(context);
                    })
                }
            }

            impl IntrStreamCtx for Tx<$USARTX> {
                fn unlisten_ctx(&mut self, ctx: Option<&mut Context>) {
                    if let Some(ctx) = ctx {
                        ctx.tx_waker = None;
                    }
                    unsafe { (*$USARTX::ptr())
                        .cr1.modify(|_, w| w.txeie().clear_bit().tcie().clear_bit())}
                }
            }

            static $ctxX : Mutex<RefCell<Option<Context>>> =
                Mutex::new(RefCell::new(None));

